/*
 简体中文
 */
"hello" = "你好";

"app.notOppen"                    = "暂未开放";
"app.reminder"                    = "提示";
"app.sure"                        = "确定";
"app.cancel"                      = "取消";
"app.changeLanguageMessage"       = "您确定要将当前语言转变为%@吗?";
"app.openCameraPermissions"       = "请前往'设置'中，打开相机权限";
"app.openAlblumPermissions"       = "请前往'设置'中打开相册权限";

"app.touchID_touchIDMessage"      = "请输入指纹";
"app.touchID_usePhone"            = "用手机号登录";
"app.touchID_useTouchID"          = "用Touch ID登录";

"app.refresh.title"               = "有新版本了";
"app.refresh.sure"                = "去更新";

"app.noData"                      = "暂无数据";

"app.name"                        = "莓果";

//-----------------------Login---------------------
"login.loginTitle"                = "登录";
"login.inputPhone"                = "请输入手机号";
"login.inputPwd"                  = "请输入密码";
"login.forgetPwd"                 = "忘记密码?";
"login.registerTitle"             = "注册";


"register.codeTitle"              = "验证码";
"register.codeBtnTitle"           = "获取验证码";
"register.codeBtnCountDownTitle"  = "%lds";
"register.inputPwd"               = "请输入密码(6-20位)";
"register.re_inputPwd"            = "请重新输入密码";
"register.inputNickName"          = "请输入昵称(4-16位)";
"register.agreTermBefore"         = "点击注册即代表同意";
"register.agreTermAfter"          = "《用户协议》";
"register.codeSendSuccess"        = "验证码发送成功，请注意查收";
"register.success"                = "注册成功，请登录";


"finPwd.title"                    = "找回密码";
"finPwd.next"                     = "下一步";
"findPwd.using"                   = "您正在通过以下手机找回密码";
"findPwd.codeTitle"               = "验证码";
"findPwd.done"                    = "完成";
"findPwd.success"                 = "重新设置密码成功，请重新登录";


//-----------------------TabBar---------------------
"tabBar.main"                      = "首页";
"tabBar.community"                 = "社区";
"tabBar.wallet"                    = "钱包";
"tabBar.me"                        = "我的";

//------------------------Main-----------------------
"main.naviTitle"                   = "BlockCDN";
"main.incomeTitle"                 = "我的收益";
"main.serviceTitle"                = "我的服务";
"main.incomYesterday"              = "昨日收益";
"main.incomBCDN"                   = "  BCDN";
"main.incomCurrent"                = "当前价格≈  ";
"main.incomUSDNBCDN"               = "  USD/BCDN";
"main.incomeTotalIncome"           = "总收益(BCDN)";
"main.incomeTotalValue"            = "总市值(USD)";
"main.machineOnline"               = "矿机在线";

"main.serviceBtnTitle1"            = "预约抽码";
"main.serviceBtnTitle2"            = "资产导入";
"main.serviceBtnTitle3"            = "绑定挖矿码";


"main.apponitCodeNaviTitle"        = "预约抽码";
"main.apponitCodeDayTitle"         = "天";
"main.apponitCodeHourTitle"        = "时";
"main.apponitCodeMinuteTitle"      = "分";
"main.apponitCodeSecondTitle"      = "秒";
"main.apponitCodeFormatTime"       = "距离 %@ 抽码";


"main.appointCodeNotBindETHTitle"  = "绑定ETH钱包地址后才能参与抽奖";
"main.appointCodePersonTitle"      = "当前预约总人数:%@";
"main.appointCodeBindETHTitle"     = "立即绑定";
"main.appointCodeBindETHNotice"    = "[特别提示]\n\n1.绑定的ETH地址为您的验资ETH地址,您必须确保地址上至少拥有1000个BCDN才能绑定成功.\n2.绑定成功意味着你验资成功,验资成功后您将具有挖矿码的抽码资格\n3.验资地址即为您以后提取挖矿收益的提现地址,即以后您通过挖矿获取了BCDN代币,只能提到验资地址上.此地址一经绑定后不可更改.";

"main.appointCodeCodeTitle"        = "您的预约码";
"main.appointCodePasterSuccess"    = "复制成功";
"main.appointCodeSuccessNotice"    = "[特别提示]\n\n1.验资成功后您将获得预约码,此预约码不等于挖矿码.\n2.获得预约码后,你不用做任何操作,等待挖矿码开奖时间开奖即可.\n3.到开奖时间,系统会从预约码池中随机抽取一定数量的预约码.\n4.开奖后若成功中奖,那么您的预约码将成为挖矿码;若您未中奖,那么此预约码会作废.\n5.未中奖的用户,可以下期继续抽奖,下期会为您随机分配不同的预约码参与抽奖.";



"main.appointCodeJoinTitle"        = "您还未参与本期抢码活动，赶快参与吧";
"main.appointCodeJoinETHTitle"     = "ETH地址:%@";
"main.appointCodeJoin"             = "立即预约";

"main.appointCodeJointPeopleTitle" = "预约人数";
"main.appointCodeJointPeopleCount" = "%@人";

"main.appointCodeSuccessTitle"     = "恭喜抢码成功";
"main.appointCodeSuccessCodeTitle" = "您的预约码";
"main.appointCodeSuccessPastTitle" = "长按复制";


"main.appointCodeFaildTitle"       = "抽码失败，请下次努力";
"main.appointCodeFaildCodeTitle"   = "您的预约码";
"main.appointCodeFaildAgainTitle"  = "再次预约";


"main.appointCodeLotteryListTitle" = "中奖纪录";
"main.appointCodeCongratulationTitle"  = "恭喜%@获得挖矿码";

"main.appointmentGetCodeSuccess"   = "预约成功";



"main.bindMiningCode.miningCodeTitle"        = "挖矿码";
"main.bindMiningCode.miningCodePlaceHolder"  = "请输入挖矿码";
"main.bindMiningCode.sure"                   = "确认";
"main.bindMiningCode.message"                = "[温馨提示]\n\n1.BlockCDN第一代矿机莓果必须绑定挖矿码才能开始挖矿.\n2.挖矿码分为W开头的和S开头的2种.其中W挖矿码必须通过莓果APP参于预约抽码获得,S挖矿码则通过参与BlockCDN社区活动获得.\n3.W挖矿码只能与参与抽码的莓果帐号绑定,S挖矿码可与任意的莓果帐号绑定.\n4.挖矿码与提现地址相绑定,不管是W还是S挖矿码一经绑定,概不能解绑,请谨慎操作.";
"main.bindMiningCode.success"                = "绑定成功";


"main.importProperty.naviTitle"              = "资产导入";
"main.importProperty.title1"                 = "官网资产";
"main.importProperty.title2"                 = "内测挖矿收益";
"main.importProperty.officalWeb.emailTitle"                 = "邮箱地址";
"main.importProperty.officalWeb.correctEmail"               = "请输入正确的邮箱";
"main.importProperty.officalWeb.emailPlaceHolder"           = "请输入官网注册的邮箱地址";
"main.importProperty.officalWeb.verifyCodeTitle"            = "验证码";
"main.importProperty.officalWeb.verifyCodePlaceHolder"      = "请输入验证码";
"main.importProperty.officalWeb.pwdTitle"                   = "官网登录密码";
"main.importProperty.officalWeb.pwdPlaceHolder"             = "请输入官网登录密码";
"main.importProperty.officalWeb.sureTitle"                  = "确认";
"main.importProperty.officalWeb.success"                    = "导入成功";
"main.importProperty.officalWeb.message"                    = "[温馨提示]\n\n1.导入官网资产针对在BlockCDN官网有BTC,ETH和合法BCDN代币的用户.\n%@\n3.官网资产导入后,您在官网的BCDN代币将同步增加到莓果APP余额当中.\n4.成功导入官网资产后,您在官网的所有资产将清零,请谨慎操作.";
"main.importProperty.officalWeb.message1"                   = "2.特别提示:由于官网的退币退款工作早已结束，所有退币提现功能已经关闭，如果您在官网还有BTC和ETH余额,那么成功导入官网资产时将自动按照1BTC兑换61000BCDN,1ETH兑换5000BCDN的比例为您自动兑换成BCDN代币.";
"main.importProperty.testIncome.ethTitle"                   = "ETH地址";
"main.importProperty.testIncome.ethPlaceHolder"             = "请输入ETH地址";
"main.importProperty.testIncome.codeTitle"                  = "内测码";
"main.importProperty.testIncome.codePlaceHolder"            = "请输入内测码";
"main.importProperty.testIncome.sureTitle"                  = "确认";
"main.importProperty.testIncome.success"                    = "导入成功";
"main.importProperty.testIncome.message"                    = "[温馨提示]\n\n1.导入内测挖矿收益针对莓果矿机推出前的早期矿工收益.\n2.原内测矿机作废,原矿机提现功能同时作废,所有内测期间的挖矿资产需导入莓果APP方可提现.\n3.ETH地址请输入测试矿机绑定的ETH地址,内测码请输入测试矿机绑定的内测挖矿码.\n4.ETH地址和内测码是绑定配对的,遗忘任何一个均无法导入早期内测挖矿收益.\n5.成功导入内测挖矿收益后,原内测矿机数据将清零.";
"main.importProperty.alertTitle1"                           = "您的官网钱包余额";
"main.importProperty.alertTitle2"                           = "您的内测挖矿收益余额";
"main.importProperty.alertBCDNCount"                        = "%@ BCDN";
"main.importProperty.alertOnceImport"                       = "一键导入";



//-----------------------Bind ETH---------------------------
"bindETH.naviTitle"                = "绑定ETH";
"bindETH.title"                    = "请输入您持有大于 1000 BCDN 的账户";
"bindETH.inputHolder"              = "请输入ETH地址";
"bindETH.bindTitle"                = "绑定ETH地址";
"bindETH.message1"                 = "备注：为了防止恶意刷码，您必须保证您的账号在预约和开奖期间内持有超过 1000 BCDN。否则将影响您的抽奖资格！%@";
"bindETH.message2"                 = "该挖矿激活码的所有挖矿收益只能提现到本验证钱包，且验证后无法更改";
"bindETH.success"                  = "绑定ETH成功";


"bindETH.new.naviTitle"            = "选择验资地址";
"bindETH.new.defaultTitle"         = "请输入您的ETH钱包地址";
"bindETH.new.defaultPlaceHolder"   = "请输入您的ETH钱包地址";
"bindETH.new.gateIOTitle"          = "请输入您的gate.io充值地址";
"bindETH.new.gateIOPlaceHolder"    = "请输入您的gate.io地址";
"bindETH.new.bindBtnTitle"         = "立即绑定";
"bindETH.new.bindMessage"          = "1.验资方式分为个人ETH钱包地址验资和Gate.io交易所BCDN充值地址验资2种方式.个人钱包地址为非交易所地址,如mist,parity,myetherwallet,imtoken这样的个人钱包地址。Gate.io交易所充值地址验资为您在gate.io交易所个人帐户的BCDN充值地址.\n2.无论是个人EHT钱包地址还是Gate.io交易所个人账户的BCDN充值地址上,您都必须保证拥有的BCDN数量大于等于1000,才能通过验资.通过验资后,您才有参与挖矿码抽取的资格.\n3.验资不需要转账,所有BCDN代币存在您的钱包和帐户中,您拥有完全的自主权和控制权.\n4.因为您对验资的BCDN代币拥有完全的控制权,所以无论何时,我们都无法冻结您的验资资金,理论上您可以自由转移您的BCDN代币.但在成功验资后,若想获得挖矿码,您必须保证验资的BCDN代币一直存在于验资地址上,直到成功抽取挖矿码后;如果在您成功获得挖矿码前,您的验资地址上的BCDN代币小于1000个,那么即使您验资成功,您仍将无法获得BCDN挖矿码.\n5.验资地址即为您以后提取挖矿收益的提现地址,即以后您通过挖矿获取了BCDN代币,只能提到验资地址上。验资地址一经绑定后不可更改.";
"bindETH.new.bindGateIOSucess"     = "绑定gate.io地址成功";


//-----------------------Community----------------------
"community.naviTitle"              = "社区";



//-----------------------Wallet----------------------
"wallet.naviTitle"                 = "钱包";
"wallet.BCDN"                      = "BCDN";
"wallet.remain"                    = "钱包余额";
"wallet.will"                      = "审核中";

"wallet.gridBillTitle"             = "账单";
"wallet.gridDepositTitle"          = "提现";
"wallet.gridChargeTitle"           = "充值";
"wallet.gridTransferTitle"         = "转账";
"wallet.gridMiningIncomeTitle"     = "挖矿收益";



"wallet.depositNaviTitle"          = "提现";
"wallet.depositHistoryTitle"       = "提现历史";
"wallet.depositTitle1"             = "BCDN提现地址:\n%@";
"wallet.depositTitle2"             = "提现数额:";
"wallet.depositTitle3"             = "提现金额";
"wallet.depositTitle4"             = "可用余额";
"wallet.depositTitle5"             = "手续费";
"wallet.depositTitle6"             = "全部提现";
"wallet.depositTitle7"             = "BCDN";
"wallet.depositTitle8"             = "下一步";
"wallet.depositTitle9"             = "提现:从钱包提现至您所绑定的ETH地址";
"wallet.depositTitle10"            = "您还没有绑定ETH地址!";


"wallet.depositVerifyTitle"        = "验证信息";
"wallet.depositVerifyDone"         = "完成";
"wallet.depositSuccess"            = "提现成功";


"wallet.reminder"                  = "提示";
"wallet.reminderMessage"           = "您还没有绑定ETH地址，暂时无法提现";
"wallet.reminderCancel"            = "取消";
"wallet.reminderGo"                = "立即绑定";


"wallet.depositHistoryReady"       = "审核中";
"wallet.depositHistoryFaild"       = "提现失败";
"wallet.depositHistorySuccess"     = "提现成功";
"wallet.depositHistoryBCDN"        = "BCDN";





"wallet.miningIncomeNaviTitle"     = "挖矿收益";
"wallet.miningIncomeBCDN"          = "BCDN";
"wallet.miningIncomeSumIncome"     = "挖矿收益";
"wallet.miningIncomeTodayIncome"   = "昨日挖矿收益";
"wallet.miningHistoryTitle"        = "挖矿历史";
"wallet.miningTableTitle"          = "矿机编号";


"wallet.transfer.typeCommon"       = "普通转账";
"wallet.transfer.typeWechat"       = "微信红包提现";
"wallet.transfer.typeAssetImport"  = "资产导入";
"wallet.transfer.typeUnknown"      = "未知转账";
"wallet.transfer.stateWait"        = "审核中";
"wallet.transfer.stateSuccess"     = "转账成功";
"wallet.transfer.stateFail"        = "转账失败";


//------------------------Me--------------------------
"me.naviTitle"                      = "个人中心";

"me.headTitle"                      = "头像";
"me.nickNameTitle"                  = "昵称";
"me.ETHTitle"                       = "ETH地址";
"me.phoneTitle"                     = "手机号";
"me.myMiningCode"                   = "我的挖矿码";
"me.languageTitle"                  = "多语言";
"me.modifyPwdTitle"                 = "修改密码";
"me.versionTitle"                   = "版本更新";
"me.aboutTitle"                     = "关于BlockCDN";
"me.exit"                           = "退出登录";

"me.copy"                           = "复制";
"me.mineMachineOnline"              = "在线";
"me.mineMachineOff"                 = "离线";
"me.noMiningCode"                   = "无挖矿码";

"me.bindETH"                        = "暂无ETH地址";

"me.cameraTitle"                    = "拍照";
"me.alblumTitle"                    = "从相册选择";
"me.cancelTitle"                    = "取消";


"me.logoutTitle"                    = "提示";
"me.logoutMessage"                  = "您确定要退出登录吗?";
"me.logoutSure"                     = "确认";
"me.logoutCancel"                   = "取消";


"me.modifyNameTitle"                = "修改昵称";
"me.modifyNamePlaceholder"          = "请输入昵称(4-16位)";
"me.notEmoji"                       = "昵称中不能含有表情";
"me.modifyNameSubmitTitle"          = "提交";
"me.modifyNameSuccess"              = "修改成功";


"me.modifyPhoneTitle"               = "修改手机号";


"me.modifyPwdTitle"                 = "修改密码";
"me.modifyInputOriginPwdTitle"      = "请输入原密码";
"me.modifyInputNewPwdTitle"         = "请输入新密码(6-20位)";
"me.modifyReInputNewPwdTitle"       = "请再次输入新密码";
"me.modifyInputCodeTitle"           = "请输入验证码";
"me.modifySureTitle"                = "确认";
"me.modifyPwdSuccess"               = "密码修改成功，请重新登录";




//------------------------Net Return Code-----------------
"return_302"                       = "登录失败，您输入的密码或者账号可能出错";
"return_303"                       = "您的登录已失效，请重新登录";
"return_315"                       = "手机号码不存在";
"return_413"                       = "验证码错误或者该手机号已被注册";
"return_414"                       = "验证码错误";
"return_304"                       = "头像上传失败";
"return_305"                       = "修改手机号失败";
"return_422"                       = "该手机号已被注册";
"return_2000"                      = "您的BCDN数量为%@,不能参与本次抢码";
"return_2002"                      = "ETH地址错误或者该ETH地址已经被绑定";
"return_2101"                      = "该挖矿码不存在";
"return_2102"                      = "该挖矿码已经被绑定";


//验证码发送成功
"return_300000"                    = "验证码发送成功，请注意查收";
//验证码发送失败
"return_300001"                    = "验证码发送失败";
//验证码错误
"return_500002"                    = "验证码错误";
//验证码过期
"return_500003"                    = "验证码失效";
//获取官网资产成功
"return_500110"                    = "获取官网资产成功";
//输入信息有误
"return_500111"                    = "您的信息输入有误，请重新输入";
//BCD余额不足
"return_500112"                    = "您的BCDN余额不足，不能导入";
//导入资产成功
"return_500120"                    = "导入资产成功";
//导入资产失败
"return_500121"                    = "导入资产失败";
//获取内测挖矿收益资产成功
"return_500130"                    = "获取资产成功";
//输入信息有误
"return_500131"                    = "您的信息输入有误，请重新输入";
//BCDN余额不足
"return_500132"                    = "您的BCDN余额不足，不能导入";
//导入资产成功
"return_500140"                    = "导入资产成功";
//导入资产失败
"return_500141"                    = "导入资产失败";
//获取数据成功
"return_500200"                    = "获取数据成功";
//获取转账数据成功
"return_700300"                    = "获取数据成功";







